#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

/* 	位运算符：
		将数值，转为二进制后，按位操作
	按位&：
		对应位的值如果都为1才为1，有一个为0就为0
        全真为真，一假则假
	按位｜：
		对应位的值如果都是0才为0，有一个为1就为1
        一真则真，全假则假
	异或^:
		二元：a^b
			对应位的值不同为1，相同为0
            不同为真，相同为假
		一元：^b
			按位去反：
				1-->0
				0-->1
	位清空：&^
		对于 a &^ b
			对于b上的每个数值
			如果为0，则取a对应位上的数值
			如果为1，则结果位就取0 
	位移运算符：
		<<:按位左移，将a转为二进制，向左移动b位
		a << b
		>>:按位右移，将a转为二进制，向右移动b位  负数高位补1
		a >> b*/



// short
// int main()
// {
// 	short s = 0;
// 	int a = 10;
// 	printf("%d\n", sizeof(s = a + 5));
// 	printf("%d\n", s);
// 	return 0;
// }


/* // int main()
// {
// 	int a = 11;
// 	a = a | (1 << 2);
// 	printf("%d\n", a);//15
// 	a = a & (~(1<<2));
// 	printf("%d\n", a);//11

// 	//00000000 00000000 00000000 00001011   15
// 	//00000000 00000000 00000000 00000100   1
// 	//1<<2;
// 	//

// 	//0000000000000000000000000000001111
// 	//1111111111111111111111111111111011
// 	//0000000000000000000000000000000100
// 	//0000000000000000000000000000001011
// 	//
// 	//
// 	//int a = 0;
// 	////~ 按（2进制）位取反
// 	////00000000000000000000000000000000
// 	////11111111111111111111111111111111 - 补码
// 	////11111111111111111111111111111110 - 反码
// 	////10000000000000000000000000000001 - 原码
// 	////-1
// 	//printf("%d\n", ~a);

// 	return 0;
// } */

//学生
//int float
//
//创建一个结构体类型-struct Stu
//struct Stu
//{
//	//成员变量
//	char name[20];
//	int age;
//	char id[20];
//};
//
//int main()
//{
//	int a = 10;
//	//使用struct Stu这个类型创建了一个学生对象s1，并初始化
//	struct Stu s1 = {"张三", 20, "2019010305"};
//	struct Stu* ps = &s1;
//
//	printf("%s\n", ps->name);
//	printf("%d\n", ps->age);
//	//结构体指针->成员名
//
//	/*printf("%s\n", (*ps).name);
//	printf("%d\n", (*ps).age);*/
//
//	/*printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);*/
//	//结构体变量.成员名
//	return 0;
//}
//



//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//00000011 - a
//	//
//	char b = 127;
//	//‭00000000000000000000000001111111
//	//‬01111111 - b
//
//	//a和b如何相加
//	//00000000 00000000 00000000 00000011
//	//00000000 00000000 00000000 01111111
//	//00000000 00000000 00000000 10000010
//	//
//	char c = a + b;
//	//10000010-c
//	//11111111111111111111111110000010 - 补码
//	//11111111111111111111111110000001 - 反码
//	//10000000000000000000000001111110- 原码
//	//-126
//	printf("%d\n", c);
//
//	return 0;
//}

//实例1
//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	return 0;
//}


//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(!c));//1
//	return 0;
//}




