#include <stdio.h>
#include <limits.h>
// int main(){
//     int a = 20;//4个字节-32bit
//     //00000000 00000000 00000000 00010100 - 原码
//     //00000000 00000000 00000000 00010100 - 反码
//     //00000000 00000000 00000000 00010100 - 补码
//     //0x 00 00 00 14

//     int b = -10;
//     //10000000 00000000 00000000 00001010 - 原码
//     //11111111 11111111 11111111 11110101 - 反码
//     //11111111 11111111 11111111 11110110 - 补码    // 反码加1就是补码
//     //0x FF FF FF F6
//     return 0;
// }

// 大小端判断方法
/* int check_sys(){

    int a = 20;
    char* p = (char* )&a;
    return *p;
}

int main(){

    int ret = check_sys();
    if(ret == 20)
        printf("小端\r\n");
    else
        printf("大端\r\n");
    return 0;
} */

// 整型提升案例,数据的存储 
/* int main(){

    char a = -1;
    // 10000000 00000000 00000000 00000001
    // 11111111 11111111 11111111 11111110
    // 11111111 11111111 11111111 11111111
    // 11111111                                 char里面的数据
    // 11111111 11111111 11111111 11111111      整型提升

    signed char b = -1;

    unsigned char c = -1;
    // 11111111                                 char里面的数据
    // 00000000 00000000 00000000 11111111      无符号数整型提升,空白位补0
    printf("a = %d, b = %d, c = %d\r\n", a, b, c);
    return 0;
} */

/* int main(){

    char a = -128;
    char b = 128;
    // 两个为啥一样,cpu加法器,127+1 = -128
    printf("%u\r\n, %u\r\n", b);
    return 0;
} */

int main(){

    float f = 5.5;
    // (-1)^S * M * 2^E 
    // (-1)^S表示符号位,当s = 0, V为正数, s = 0 负数
    // M表示有效数字,大于等于1,小于2
    // 2^E表示指数位
    // 5.5         5.0 + 0.5
    // 101.1       101 + 0.1
    // (-1)^0 * 1.011 * 2 ^ 2
    // s = 0
    // m = 1.011
    // e = 2 + 127
    // s e        m
    // 0 10000001 01100000 00000000 0000000
    // 01000000 10110000 00000000 00000000
    // 0x40b00000
    return 0;
}







